"""
Важливо: не використовувати цикли для реалізації основної логіки.

Потрібно використати рекурсію.

Цикл можна використовувати лише у 4 завданні для знаходження суми чисел.

Завдання 1.

Написати рекурсивну функцію знаходження ступеня числа.

Завдання 2.

Написати рекурсивну функцію, яка виводить N зірок у ряд, число N задає користувач.

Проілюструйте роботу функції прикладом. (Протестувати)

Завдання 3.

Написати рекурсивну функцію, яка обчислює суму всіх чисел у діапазоні від a до b.

Користувач вводить a та b. Проілюструйте роботу функції прикладом.

Додатково:

Завдання 4.

Напишіть рекурсивну функцію, яка приймає одновимірний масив із 100 цілих чисел заповнених випадковим чином і знаходить
позицію, з якої починається послідовність із 10 чисел, сума яких мінімальна.
"""
